# Terraform - genesis
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
src/shared/infrastructure/genesis relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/genesis/runs/run-gA2BrZKcNbpgLaX3

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.tfe_organization.default: Refreshing...
module.common_resources_production.data.tfe_organization.default: Refreshing...
module.common_resources_staging.data.tfe_organization.default: Refreshing...
module.common_resources_production.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_production.tfe_project.default: Refreshing state... [id=prj-xDogCes5ct2uhMNM]
data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_staging.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_staging.tfe_project.default: Refreshing state... [id=prj-NxDcK4y5LJDcB2YB]
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-qg9ea5EiCy7xfZfq]
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-Pb24XXh7Euvb8egj]
module.common_resources_production.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-4H2k3gN7bZbDBrwc]
module.common_resources_production.module.web.tfe_workspace.web: Refreshing state... [id=ws-ceG4KDEizprKoE49]
module.common_resources_production.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-wT4uthH39e49iyYa]
module.common_resources_production.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-1Wz5AWByHQ1E5Y1k]
module.common_resources_production.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-bdSNhGdBkD9jzcEw]
module.common_resources_production.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-nT1MUhnXeZ6mLnrZ]
module.common_resources_production.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-qarqwrc9CJrJ7MCH]
module.common_resources_production.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-RTVrVt1pwUuQd69H]
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-itUUG9zTtND6QC8b]
module.common_resources_staging.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-V7mD9efKYo6ALq8G]
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-YNorxUn3d16viGSy]
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-vXKhAn9MVg9FpgtG]
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-bpyNscPvrfk6pEvN]
module.common_resources_staging.module.web.tfe_workspace.web: Refreshing state... [id=ws-S73yxaWh99tLFixY]
module.common_resources_staging.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-qVghUjUtJMfc71fQ]
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-D19c9mQYdPtsCYX9]
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-bgmymAbXR6cuxcCf]
module.common_resources_staging.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-zhuPdvVJkwvB4nbV]
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-LZaKbasjd1YHUxeG]
module.common_resources_staging.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-SkSrWo5g3r3vfTWs]
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_production.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_staging.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tfe_project.shared_project_name will be created
  + resource "tfe_project" "shared_project_name" {
      + id           = (known after apply)
      + name         = "shared"
      + organization = "connectilly"
    }

  # tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "shared",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/shared"
    }

  # module.common_resources_production.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-xDogCes5ct2uhMNM" -> (known after apply)
        name         = "production"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_staging.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
        name         = "staging"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-Pb24XXh7Euvb8egj" -> (known after apply)
        name                          = "production_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer" -> (known after apply)
      ~ id                            = "ws-RTVrVt1pwUuQd69H" -> (known after apply)
        name                          = "production_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer_api" -> (known after apply)
      ~ id                            = "ws-nT1MUhnXeZ6mLnrZ" -> (known after apply)
        name                          = "production_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gateway_api" -> (known after apply)
      ~ id                            = "ws-itUUG9zTtND6QC8b" -> (known after apply)
        name                          = "production_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-qg9ea5EiCy7xfZfq" -> (known after apply)
        name                          = "production_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity" -> (known after apply)
      ~ id                            = "ws-wT4uthH39e49iyYa" -> (known after apply)
        name                          = "production_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity_api" -> (known after apply)
      ~ id                            = "ws-bdSNhGdBkD9jzcEw" -> (known after apply)
        name                          = "production_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization" -> (known after apply)
      ~ id                            = "ws-4H2k3gN7bZbDBrwc" -> (known after apply)
        name                          = "production_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization_api" -> (known after apply)
      ~ id                            = "ws-1Wz5AWByHQ1E5Y1k" -> (known after apply)
        name                          = "production_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_shared" -> (known after apply)
      ~ id                            = "ws-qarqwrc9CJrJ7MCH" -> (known after apply)
        name                          = "production_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_web" -> (known after apply)
      ~ id                            = "ws-ceG4KDEizprKoE49" -> (known after apply)
        name                          = "production_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-xDogCes5ct2uhMNM" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-bpyNscPvrfk6pEvN" -> (known after apply)
        name                          = "staging_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer" -> (known after apply)
      ~ id                            = "ws-zhuPdvVJkwvB4nbV" -> (known after apply)
        name                          = "staging_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer_api" -> (known after apply)
      ~ id                            = "ws-LZaKbasjd1YHUxeG" -> (known after apply)
        name                          = "staging_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gateway_api" -> (known after apply)
      ~ id                            = "ws-YNorxUn3d16viGSy" -> (known after apply)
        name                          = "staging_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-bgmymAbXR6cuxcCf" -> (known after apply)
        name                          = "staging_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity" -> (known after apply)
      ~ id                            = "ws-V7mD9efKYo6ALq8G" -> (known after apply)
        name                          = "staging_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity_api" -> (known after apply)
      ~ id                            = "ws-vXKhAn9MVg9FpgtG" -> (known after apply)
        name                          = "staging_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization" -> (known after apply)
      ~ id                            = "ws-qVghUjUtJMfc71fQ" -> (known after apply)
        name                          = "staging_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization_api" -> (known after apply)
      ~ id                            = "ws-D19c9mQYdPtsCYX9" -> (known after apply)
        name                          = "staging_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_shared" -> (known after apply)
      ~ id                            = "ws-SkSrWo5g3r3vfTWs" -> (known after apply)
        name                          = "staging_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_web" -> (known after apply)
      ~ id                            = "ws-S73yxaWh99tLFixY" -> (known after apply)
        name                          = "staging_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-NxDcK4y5LJDcB2YB" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

Plan: 26 to add, 0 to change, 24 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*